{"extraResources":{"example.01.mu":"TVXzATUNCjEgMiAzIDIgNA0KMiAzIDEgNCAyDQo0DQoxIDMgMSAzDQoxIDIgMyA1DQoxIDQgMiA1DQoxIDUgMSA1DQo="},"scoring":"There are some subtasks in this problem, you will get the percentage of score if you pass the subtask\n\n\\begin{center}\n  \\begin{tabular}{ | c | c | c | c | } \\hline\n    \\bf{Subtask} &\n    \\bf{Condition} &\n    \\bf{Score} &\n    \\bf{Additional Limitations} \\\\ \\hline\n    $1$ & $n,q \\le 1000$ & $40\\%$ & None \\\\ \\hline\n    $2$ & No additional constraints & $60\\%$ & Must pass Subtask 1 \\\\ \\hline\n    \\end{tabular}\n\\end{center}","notes":"\\begin{itemize}\n    \\item For the first query, the group of boxes from the first row cannot be shuffled to match the target group from the second row.\n    \\item For the second query, the shuffling magic allows you to rearrange the group from the first row to match the target group.\n    \\item For the third query, you can rotate the entire group from the first row to perfectly match the group from the second row.\n\\end{itemize}","legend":"In the heart of Algoria, during the annual festival, a thrilling challenge called \\textbf{The Great Box Shuffle} captivates all who attend. The challenge involves two long rows of enchanted boxes, each containing a collection of mystical items. The boxes in the two rows are enchanted in such a way that, with a bit of magic, their contents can be shuffled to match each other.\n\n\\begin{center}\n  \\def \\htmlPixelsInCm {45}  % pixels in 1 centimeter in HTML mode\n  \\includegraphics[width=4cm]{box.png} \\\\\n  \\small{The Great Box Shuffle festival in Algoria}\n\\end{center}\n\nYou are the chosen contestant this year, and your task is to determine if specific groups of boxes from the first row can be rearranged to perfectly match groups of boxes from the second row. However, the magical rules of the festival only allow you to shuffle the items within a contiguous group of boxes, rotating them either to the left or right.\n\nThroughout the challenge, you will be given several queries. Each query will ask if a particular group of boxes from the first row can be rearranged to match a group of boxes from the second row using the allowed shuffling magic.\n\nMore formally, you are given two sequences \\( A \\) and \\( B \\), each of length \\( N \\). You need to answer \\( q \\) queries. Each query is defined by four integers \\( l_1 \\), \\( r_1 \\), \\( l_2 \\), and \\( r_2 \\). For each query, you must determine if the subarray \\( A[l_1..r_1] \\) can be shuffled to match the subarray \\( B[l_2..r_2] \\) by rotating the items within the selected segment.","authorLogin":"slee","language":"english","timeLimit":1000,"output":"For each query, print \\texttt{Yes} if you can shuffle the group of boxes from the first row to match the corresponding group from the second row. Otherwise, print \\texttt{No}.","inputFile":"stdin","outputFile":"stdout","input":"\\begin{itemize}\n    \\item The first line contains a single integer \\( N \\) --- the number of boxes in each row.\n    \\item The second line contains \\( N \\) integers \\( A_1, A_2, \\dots, A_N \\), where \\( A_i \\) represents the number of items in the \\( i \\)-th box of the first row.\n    \\item The third line contains \\( N \\) integers \\( B_1, B_2, \\dots, B_N \\), where \\( B_i \\) represents the number of items in the \\( i \\)-th box of the second row.\n    \\item The fourth line contains a single integer \\( q \\) --- the number of queries.\n    \\item The next \\( q \\) lines each contain four integers \\( l_1 \\), \\( r_1 \\), \\( l_2 \\), and \\( r_2 \\). For each query, you need to determine whether it is possible to shuffle the group of boxes from the first row (from box \\( l_1 \\) to box \\( r_1 \\)) to match the corresponding group of boxes from the second row (from box \\( l_2 \\) to box \\( r_2 \\)).\n\\end{itemize}\n\n\\section*{Constraints}\n\n\\begin{itemize}\n    \\item \\( 1 \\leq N, Q \\leq 200,000 \\)\n    \\item \\( 1 \\leq l_1 \\leq r_1 \\leq N \\)\n    \\item \\( 1 \\leq l_2 \\leq r_2 \\leq N \\)\n    \\item \\( 1 \\leq A_i, B_i \\leq N \\)\n\\end{itemize}","authorName":"Sam Lee","sampleTests":[{"output":"Yes\r\nNo\r\nNo\r\nYes\r\n","input":"5\r\n1 2 3 2 4\r\n2 3 1 4 2\r\n4\r\n1 3 1 3\r\n1 2 3 5\r\n1 4 2 5\r\n1 5 1 5\r\n","inputFile":"example.01","outputFile":"example.01.a"}],"name":"The Great Box Shuffle","interaction":null,"memoryLimit":268435456,"tutorial":""}